[
  {
    "id": 1,
    "timestamp": "4/19/2025 0:00:00",
    "category": "Politics",
    "title": "India’s Modi and Elon Musk Discuss Potential Tech Collaboration",
    "summary": "Indian Prime Minister Narendra Modi recently engaged in a conversation with Elon Musk, revisiting topics from their earlier meeting in Washington, D.C. The discussion centered on potential collaborations in technology and innovation, underscoring ongoing efforts to strengthen partnerships between India and global tech leaders.",
    "imageUrl": "https://res.cloudinary.com/dgexwlxja/image/upload/v1745044282/quickNews/1.avif",
    "imagePreview": "",
    "tags": "Modi, Elon Musk, Technology, India, Innovation",
    "source": "TOI",
    "author": "Sahil"
  },
  {
    "id": 2,
    "timestamp": "4/19/2025 2:00:00",
    "category": "Business",
    "title": "BlackRock Plans to Hire 1,200 in India to Boost AI Capabilities",
    "summary": "BlackRock is set to expand its support hubs in Mumbai and Gurugram by hiring nearly 1,200 new employees to enhance its artificial intelligence capabilities. This move will increase its headcount to about 3,500, reflecting the firm’s commitment to leveraging India’s talent pool for global operations.",
    "imageUrl": "https://res.cloudinary.com/dgexwlxja/image/upload/v1745044282/quickNews/2.avif",
    "imagePreview": "",
    "tags": "BlackRock, AI, Hiring, India, Business Expansion",
    "source": "Hindustan Times",
    "author": "Anjali"
  },
  {
    "id": 3,
    "timestamp": "4/19/2025 4:00:00",
    "category": "Sports",
    "title": "Former Players Haunt Bengaluru as Home Woes Continue in IPL",
    "summary": "Royal Challengers Bengaluru’s struggles at home in the 2025 IPL persist with their third consecutive home defeat. Former players like Yuzvendra Chahal have been instrumental in these losses, highlighting the team’s ongoing challenges at the M Chinnaswamy Stadium despite a perfect away record.",
    "imageUrl": "https://res.cloudinary.com/dgexwlxja/image/upload/v1745044282/quickNews/3.jpg",
    "imagePreview": "",
    "tags": "IPL, Royal Challengers Bengaluru, Yuzvendra Chahal, Cricket, Sports",
    "source": "NDTV",
    "author": "Pratyush"
  },
  {
    "id": 4,
    "timestamp": "4/19/2025 6:00:00",
    "category": "Entertainment",
    "title": "Bengali Play ‘Nihsango Ishwar’ Wins Big at META 2025",
    "summary": "The Bengali play ‘Nihsango Ishwar’ emerged as the top winner at the META 2025 awards, receiving acclaim for its compelling storytelling and performances. The play’s success highlights the richness of regional theatre and its growing recognition on national platforms.",
    "imageUrl": "https://res.cloudinary.com/dgexwlxja/image/upload/v1745044283/quickNews/4.avif",
    "imagePreview": "",
    "tags": "Nihsango Ishwar, Bengali Theatre, META 2025, Arts, Entertainment",
    "source": "Indian Express",
    "author": "Pandey"
  },
  {
    "id": 5,
    "timestamp": "4/19/2025 8:00:00",
    "category": "Technology",
    "title": "Haier Launches AI-Powered ‘Climate Control’ Air Conditioners in India",
    "summary": "Haier India has introduced a new line of AI-powered air conditioners featuring personalized cooling, energy monitoring, and smart features. These ‘Climate Control’ ACs aim to provide efficient and adaptive home cooling solutions, aligning with the growing demand for smart home appliances in India.",
    "imageUrl": "https://res.cloudinary.com/dgexwlxja/image/upload/v1745044282/quickNews/5.webp",
    "imagePreview": "",
    "tags": "Haier, AI, Air Conditioners, Smart Home, Technology",
    "source": "Deccan Herald",
    "author": "Aakash"
  },
  {
    "id": 6,
    "timestamp": "4/20/2025 2:00:00",
    "category": "Business",
    "title": "RBI Cuts Repo Rate to Boost Economy",
    "summary": "The Reserve Bank of India reduced the repo rate by 25 basis points to 6% to support businesses amid global trade tensions. This unanimous decision aims to ease borrowing costs for exporters facing U.S. tariffs. The move is expected to stimulate economic growth, particularly in manufacturing and agriculture, as India strengthens its global supply chain role.",
    "imageUrl": "https://res.cloudinary.com/dgexwlxja/image/upload/v1745047674/quicknews/6.jpg",
    "imagePreview": "",
    "tags": "RBI, repo rate, Indian economy, business growth, trade tariffs, finance news, economic policy, India business",
    "source": "India Today",
    "author": "Divyansh"
  },
  {
    "id": 7,
    "timestamp": "4/20/2025 2:00:00",
    "category": "Business",
    "title": "Bitcoin Surges After Trump’s Tariff Pause",
    "summary": "Bitcoin jumped over 8% to $81,700 after U.S. President Trump announced a 90-day pause on certain tariffs. This decision eased market fears, boosting investor confidence globally, including in India’s crypto market. Indian exchanges reported increased trading volumes as businesses anticipate stable trade conditions, encouraging digital asset investments.",
    "imageUrl": "https://res.cloudinary.com/dgexwlxja/image/upload/v1745049248/quicknews/7.jpg",
    "imagePreview": "",
    "tags": "Bitcoin, cryptocurrency, Trump tariffs, Indian crypto market, business news, digital currency, global trade",
    "source": "Aaj Tak",
    "author": "Purvit"
  },
  {
    "id": 8,
    "timestamp": "4/20/2025 2:00:00",
    "category": "Business",
    "title": "Zomato Delivery Agent’s Reality Check",
    "summary": "A U.S.-returned entrepreneur worked as a Zomato delivery agent for a day in India, experiencing the challenges of navigating busy streets and meeting tight deadlines. The humbling experience highlighted the hard work of delivery workers, sparking discussions on labor conditions and corporate empathy in India’s gig economy.",
    "imageUrl": "https://res.cloudinary.com/dgexwlxja/image/upload/v1745049955/quicknews/8.jpg",
    "imagePreview": "",
    "tags": "Zomato, gig economy, delivery workers, Indian business, labor conditions, entrepreneurship, corporate empathy",
    "source": "News18.com",
    "author": "Naresh"
  },
  {
    "id": 9,
    "timestamp": "4/20/2025 2:00:00",
    "category": "Entertainment",
    "title": "Fatwa Issued Against Actor Vijay",
    "summary": "The All India Muslim Jamaat issued a fatwa against Tamil Nadu actor-politician Vijay, leader of Tamil Nadu Vijay Karthik party, over undisclosed reasons. The move has sparked controversy in the entertainment and political spheres, raising debates about freedom of expression and religious sensitivities in India’s film industry.",
    "imageUrl": "https://res.cloudinary.com/dgexwlxja/image/upload/v1745049954/quicknews/9.jpg",
    "imagePreview": "",
    "tags": "Vijay, fatwa, Tamil Nadu, entertainment news, Indian politics, freedom of expression, film industry",
    "source": "TOI",
    "author": "Kalyan"
  },
  {
    "id": 10,
    "timestamp": "4/20/2025 2:00:00",
    "category": "Entertainment",
    "title": "Anurag Kashyap Rejects Three Projects Daily",
    "summary": "Filmmaker Anurag Kashyap revealed he turns down three projects daily, claiming to be busier than Shah Rukh Khan. With five films set for release this year, he addressed online criticism, emphasizing his focus on quality cinema. His comments highlight the intense demand for creative talent in Bollywood.",
    "imageUrl": "https://res.cloudinary.com/dgexwlxja/image/upload/v1745052125/quicknews/10.jpg",
    "imagePreview": "",
    "tags": "Anurag Kashyap, Bollywood, entertainment news, Indian cinema, film projects, Shah Rukh Khan, creative talent",
    "source": "Hindustan Times",
    "author": "Anand"
  },
  {
    "id": 11,
    "timestamp": "4/20/2025 2:00:00",
    "category": "Entertainment",
    "title": "Emily in Paris Season 5 Begins Filming",
    "summary": "The popular series Emily in Paris has started filming its fifth season in Rome, but a key character will not return, disappointing fans. The show, popular in India, continues to influence fashion and travel trends, with Indian viewers eagerly awaiting the new season’s cultural twists.",
    "imageUrl": "https://res.cloudinary.com/dgexwlxja/image/upload/v1745052366/quicknews/11.jpg",
    "imagePreview": "",
    "tags": "Emily in Paris, season 5, entertainment news, Rome filming, Indian fans, fashion trends, global series",
    "source": "NDTV",
    "author": "Nemo"
  },
  {
    "id": 12,
    "timestamp": "4/20/2025 2:00:00",
    "category": "Entertainment",
    "title": "Babil Khan’s Logout Movie Review",
    "summary": "Babil Khan’s film Logout raises relevant questions about digital addiction but struggles with improbable storytelling, say critics. The movie, released in India, has sparked discussions among young audiences about balancing technology and real life, showcasing Khan’s potential as a solo lead in Bollywood.",
    "imageUrl": "https://res.cloudinary.com/dgexwlxja/image/upload/v1745128592/quicknews/12.jpg",
    "imagePreview": "",
    "tags": "Babil Khan, Logout movie, Bollywood, entertainment news, digital addiction, Indian cinema, film review",
    "source": "Indian Express",
    "author": "Sahil"
  },
  {
    "id": 13,
    "timestamp": "4/20/2025 2:00:00",
    "category": "Entertainment",
    "title": "Kushboo Sundar’s Glam Transformation",
    "summary": "Actor-politician Kushboo Sundar, aged 54, revealed a stunning new look after losing over 20 kg. Her transformation, shared on social media, has inspired fans across India, blending entertainment and fitness trends. Sundar’s journey highlights the growing focus on health and style in the Indian entertainment industry.",
    "imageUrl": "https://res.cloudinary.com/dgexwlxja/image/upload/v1745129127/quicknews/13.webp",
    "imagePreview": "",
    "tags": "Kushboo Sundar, transformation, entertainment news, fitness trends, Indian actress, health and style, Bollywood",
    "source": "Deccan Herald",
    "author": "Anjali"
  },
  {
    "id": 14,
    "timestamp": "4/20/2025 2:00:00",
    "category": "Politics",
    "title": "West Bengal Governor Visits Violence-Hit Murshidabad",
    "summary": "Governor CV Ananda Bose visited Murshidabad despite Chief Minister Mamata Banerjee’s request to avoid the area, where communal violence over the Waqf Act left three dead. The visit underscores tensions between state and central authorities, with the BJP alleging a conspiracy, intensifying political debates in West Bengal.",
    "imageUrl": "https://res.cloudinary.com/dgexwlxja/image/upload/v1745129127/quicknews/14.jpg",
    "imagePreview": "",
    "tags": "West Bengal, Murshidabad violence, Waqf Act, Indian politics, Governor Bose, Mamata Banerjee, BJP",
    "source": "India Today",
    "author": "Pratyush"
  },
  {
    "id": 15,
    "timestamp": "4/20/2025 2:00:00",
    "category": "Politics",
    "title": "Opposition Demands DPDP Act Repeal",
    "summary": "The I.N.D.I.A. bloc demanded the repeal of Section 44(3) of the Digital Personal Data Protection Act, arguing it undermines the Right to Information Act. The Congress rallied cadres to strengthen its organization against the BJP, highlighting data privacy as a key political issue in India’s digital era.",
    "imageUrl": "https://res.cloudinary.com/dgexwlxja/image/upload/v1745129947/15.jpg",
    "imagePreview": "",
    "tags": "DPDP Act, I.N.D.I.A. bloc, Congress, Indian politics, data privacy, RTI Act, political news",
    "source": "Aaj Tak",
    "author": "Pandey"
  },
  {
    "id": 16,
    "timestamp": "4/20/2025 2:00:00",
    "category": "Politics",
    "title": "BJP’s Dilip Ghosh Alleges Conspiracy in Murshidabad",
    "summary": "BJP leader Dilip Ghosh claimed a conspiracy to separate Murshidabad from West Bengal, citing recent violence where Hindus were targeted. He criticized the state police for inaction, escalating political tensions. The remarks have fueled debates about communal harmony and governance in the region.",
    "imageUrl": "https://res.cloudinary.com/dgexwlxja/image/upload/v1745129926/16.jpg",
    "imagePreview": "",
    "tags": "Dilip Ghosh, Murshidabad, BJP, Indian politics, communal violence, West Bengal, conspiracy claims",
    "source": "News18.com",
    "author": "Aakash"
  },
  {
    "id": 17,
    "timestamp": "4/20/2025 2:00:00",
    "category": "Politics",
    "title": "AIADMK-BJP Alliance Targets DMK in Tamil Nadu",
    "summary": "The AIADMK and BJP formed an alliance for Tamil Nadu’s assembly elections, attacking DMK leader M.K. Stalin over sexist remarks by a former minister. The coalition aims to challenge the ruling DMK, leveraging public discontent to strengthen their political foothold in the state.",
    "imageUrl": "https://res.cloudinary.com/dgexwlxja/image/upload/v1745131661/ChatGPT_Image_Apr_20_2025_12_13_29_PM_lwaoc1.png",
    "imagePreview": "",
    "tags": "AIADMK, BJP, DMK, Tamil Nadu politics, Indian elections, political alliance, M.K. Stalin",
    "source": "TOI",
    "author": "Divyansh"
  },
  {
    "id": 18,
    "timestamp": "4/20/2025 2:00:00",
    "category": "Politics",
    "title": "PM Modi’s Good Friday Message",
    "summary": "Prime Minister Narendra Modi shared a Good Friday message, emphasizing kindness and compassion. His words resonated with India’s Christian community and sparked discussions on inclusivity in politics. The message comes amid ongoing debates about religious harmony, reflecting Modi’s outreach to diverse groups.",
    "imageUrl": "https://res.cloudinary.com/dgexwlxja/image/upload/v1745131660/image_6_gbmrhv.jpg",
    "imagePreview": "",
    "tags": "Narendra Modi, Good Friday, Indian politics, religious harmony, inclusivity, PM message, Christian community",
    "source": "Hindustan Times",
    "author": "Purvit"
  },
  {
    "id": 19,
    "timestamp": "4/20/2025 2:00:00",
    "category": "Education",
    "title": "UK Board 10th, 12th Results Announced",
    "summary": "The Uttarakhand Board released Class 10 and 12 results for 2025, accessible via ubse.uk.gov.in. Students across India celebrated, with toppers sharing success stories. The timely announcement reflects improved digital infrastructure in education, though some students faced website access issues due to high traffic.",
    "imageUrl": "https://res.cloudinary.com/dgexwlxja/image/upload/v1745131981/image_7_oz9vj2.jpg",
    "imagePreview": "",
    "tags": "UK Board, 10th 12th results, Uttarakhand education, Indian students, exam results, digital education, academic success",
    "source": "NDTV",
    "author": "Naresh"
  },
  {
    "id": 20,
    "timestamp": "4/20/2025 2:00:00",
    "category": "Education",
    "title": "Google Offers Free AI Tools to Students",
    "summary": "Google launched a free one-year subscription to its Google One AI Premium plan for U.S. college students, offering tools like Gemini Advanced. Indian students hope for similar initiatives, as AI tools gain traction in education. The move aims to enhance academic productivity and storage access.",
    "imageUrl": "https://res.cloudinary.com/dgexwlxja/image/upload/v1745131986/Gemini_Generated_Image_xk4cihxk4cihxk4c_n0xgnq.jpg",
    "imagePreview": "",
    "tags": "Google AI, student tools, education news, Gemini Advanced, Indian education, academic productivity, technology in education",
    "source": "Indian Express",
    "author": "Kalyan"
  },
  {
    "id": 21,
    "timestamp": "4/20/2025 2:00:00",
    "category": "Education",
    "title": "IIT Alumnus’ Diverse Career Inspires",
    "summary": "Rajan Singh, an IIT graduate turned IPS officer and EdTech founder, shared his journey across eight professions on LinkedIn. His story has motivated Indian students, highlighting the value of versatility in education and career paths, encouraging youth to explore diverse opportunities.",
    "imageUrl": "https://res.cloudinary.com/dgexwlxja/image/upload/v1745132836/Ex-IPS_egk22r.avif",
    "imagePreview": "",
    "tags": "Rajan Singh, IIT, Indian education, career diversity, EdTech, student inspiration, LinkedIn trends",
    "source": "Deccan Herald",
    "author": "Anand"
  },
  {
    "id": 22,
    "timestamp": "4/20/2025 2:00:00",
    "category": "Education",
    "title": "LawSikho Uses AI to Detect Moonlighting",
    "summary": "LawSikho, an Indian online legal education platform, used AI to identify an employee moonlighting, sparking debates on workplace ethics. The incident underscores the growing role of AI in education management, raising questions about privacy and monitoring in India’s EdTech sector.",
    "imageUrl": "https://res.cloudinary.com/dgexwlxja/image/upload/v1745132801/Gemini_Generated_Image_q6vae0q6vae0q6va_qvl6kf.jpg",
    "imagePreview": "",
    "tags": "LawSikho, AI in education, moonlighting, Indian EdTech, workplace ethics, privacy concerns, education news",
    "source": "India Today",
    "author": "Nemo"
  },
  {
    "id": 23,
    "timestamp": "4/20/2025 2:00:00",
    "category": "Sports",
    "title": "Pedri Nominated for La Liga Award",
    "summary": "FC Barcelona’s Pedri, a fan favorite in India, was nominated for La Liga Player of the Month for April 2025. His game-changing performance against Dortmund earned praise, with fans comparing him to Messi. The nomination underscores his rising global influence in football.",
    "imageUrl": "https://res.cloudinary.com/dgexwlxja/image/upload/v1745320818/image_9_xqezix.jpg",
    "imagePreview": "",
    "tags": "Pedri, La Liga, Barcelona, Indian football fans, sports news, player of the month, global football",
    "source": "Aaj Tak",
    "author": "Sahil"
  },
  {
    "id": 24,
    "timestamp": "4/20/2025 2:00:00",
    "category": "Sports",
    "title": "WrestleMania 41 Predictions for Gunther vs. Jey Uso",
    "summary": "Wrestling fans in India are buzzing with predictions for the Gunther vs. Jey Uso match at WrestleMania 41. Analysts expect a high-energy clash, with both wrestlers showcasing top skills. The event’s schedule has heightened excitement, boosting WWE’s popularity in India.",
    "imageUrl": "https://res.cloudinary.com/dgexwlxja/image/upload/v1745320618/Gemini_Generated_Image_gc3wkagc3wkagc3w_gb7kmf.jpg",
    "imagePreview": "",
    "tags": "WrestleMania 41, Gunther, Jey Uso, WWE, Indian wrestling fans, sports news, match predictions",
    "source": "News18.com",
    "author": "Anjali"
  },
  {
    "id": 25,
    "timestamp": "4/20/2025 2:00:00",
    "category": "Technology",
    "title": "OpenAI’s Stargate Eyes UK Investment",
    "summary": "OpenAI’s $500 billion Stargate project is considering UK investments, impacting India’s tech sector. Indian startups collaborating with OpenAI anticipate growth in AI infrastructure, boosting innovation. The move highlights global AI competition, with India positioning itself as a key player in advanced technology development.",
    "imageUrl": "https://res.cloudinary.com/dgexwlxja/image/upload/v1745320617/image_8_y1qcox.jpg",
    "imagePreview": "",
    "tags": "OpenAI, Stargate, UK investment, Indian tech, AI innovation, technology news, global AI",
    "source": "TOI",
    "author": "Pratyush"
  },
  {
    "id": 26,
    "timestamp": "4/20/2025 2:00:00",
    "category": "Automobile",
    "title": "Over 12,000 Cars Sold Daily in India",
    "summary": "India’s automobile market is booming, with over 12,000 cars sold daily, driven by demand for personal vehicles. The Society of Indian Automobile Manufacturers reports robust growth, but urban congestion raises concerns. Electric vehicle sales are also rising, reflecting a shift toward sustainability.",
    "imageUrl": "https://res.cloudinary.com/dgexwlxja/image/upload/v1745323131/ChatGPT_Image_Apr_22_2025_05_28_24_PM_nwl4te.png",
    "imagePreview": "",
    "tags": "Indian car sales, automobile market, electric vehicles, urban congestion, sustainability, car industry, daily sales",
    "source": "Hindustan Times",
    "author": "Pandey"
  },
  {
    "id": 27,
    "timestamp": "4/20/2025 2:00:00",
    "category": "Automobile",
    "title": "Motorola’s AI-Enhanced Smartphones",
    "summary": "Motorola’s upcoming deal with Perplexity may introduce AI-powered features to its smartphones, impacting India’s automobile tech market. Enhanced navigation and driver-assist systems could integrate with vehicles, appealing to tech-savvy Indian consumers and boosting connected car trends.",
    "imageUrl": "https://res.cloudinary.com/dgexwlxja/image/upload/v1745323130/image_10_wbktqw.jpg",
    "imagePreview": "",
    "tags": "Motorola, Perplexity, AI smartphones, Indian automobile tech, connected cars, driver-assist, technology trends",
    "source": "NDTV",
    "author": "Aakash"
  },
  {
    "id": 28,
    "timestamp": "4/20/2025 2:00:00",
    "category": "Hatke",
    "title": "5-Day Cruise for Just Rs 5,000",
    "summary": "A travel company’s offer of a 5-day cruise for Rs 5,000 has grabbed attention in India, with social media buzzing about the budget-friendly adventure. The ship named MV Sindhu is built by Cochin Shipyard Ltd (CSL) for Andhaman and Nicobar Govt.",
    "imageUrl": "https://res.cloudinary.com/dgexwlxja/image/upload/v1745323534/Gemini_Generated_Image_vz5qulvz5qulvz5q_bk0qop.jpg",
    "imagePreview": "",
    "tags": "budget cruise, Rs 5000, Indian travel, offbeat news, viral deal, wanderlust, social media trends",
    "source": "Indian Express",
    "author": "Divyansh"
  },
  {
    "id": 29,
    "timestamp": "4/20/2025 2:00:00",
    "category": "Hatke",
    "title": "Urdu Writers Inspire Indian Readers",
    "summary": "A feature on Urdu writers like Saadat Manto and Ismat Chughtai, dubbed the “finest Hindustani culture,” has captivated Indian readers. The offbeat revival of classic literature has gone viral, with book clubs and social media celebrating their timeless stories.",
    "imageUrl": "https://res.cloudinary.com/dgexwlxja/image/upload/v1745323526/image_12_e6o1ji.jpg",
    "imagePreview": "",
    "tags": "Urdu writers, Manto, Chughtai, Indian literature, offbeat news, book clubs, social media trends",
    "source": "Deccan Herald",
    "author": "Purvit"
  },
  {
    "id": 30,
    "timestamp": "4/20/2025 2:00:00",
    "category": "Science",
    "title": "Exoplanet K2-18b Offers Alien Life Clues",
    "summary": "Scientists revealed five major discoveries about exoplanet K2-18b, suggesting potential for alien life. Indian researchers are excited, as the findings boost India’s space exploration ambitions. The exoplanet’s atmosphere and water traces have sparked global interest, with Indian students inspired to pursue astrophysics.",
    "imageUrl": "https://res.cloudinary.com/dgexwlxja/image/upload/v1745323941/ChatGPT_Image_Apr_22_2025_05_39_03_PM_ciewtk.png",
    "imagePreview": "",
    "tags": "exoplanet K2-18b, alien life, Indian space research, science news, astrophysics, space exploration, global discoveries",
    "source": "India Today",
    "author": "Naresh"
  },
  {
    "id": 31,
    "timestamp": "4/20/2025 2:00:00",
    "category": "Science",
    "title": "Walking 9,000 Steps Cuts Heart Risk",
    "summary": "A study found that walking 9,000 steps daily reduces heart attack risk by 50% for older adults, resonating in India. The finding promotes active lifestyles, with Indian health campaigns encouraging seniors to adopt step-count goals, supported by wearable tech.",
    "imageUrl": "https://res.cloudinary.com/dgexwlxja/image/upload/v1745324128/ChatGPT_Image_Apr_22_2025_05_45_18_PM_h3cyhm.png",
    "imagePreview": "",
    "tags": "heart health, 9000 steps, Indian seniors, science news, active lifestyle, wearable tech, health campaigns",
    "source": "Aaj Tak",
    "author": "Kalyan"
  },
  {
    "id": 32,
    "timestamp": "4/22/2025 0:00:00",
    "category": "Business",
    "title": "India-US Trade Talks Gain Momentum",
    "summary": "Indian negotiators are in Washington to discuss an 'early tranche' trade deal with the US, focusing on automobiles, whiskey, and farm products. The talks aim to leverage a 90-day tariff pause to secure mutual benefits, amidst Trump's tariff threats. Optimism is high due to strong FII inflows and positive market sentiment.",
    "imageUrl": "https://res.cloudinary.com/dgexwlxja/image/upload/v1745324698/Gemini_Generated_Image_qxfl82qxfl82qxfl_ysom4y.jpg",
    "imagePreview": "",
    "tags": "India-US trade, trade deal, tariff negotiations, automobiles, FII inflows, Trump tariffs, economic diplomacy",
    "source": "News18.com",
    "author": "Anand"
  },
  {
    "id": 33,
    "timestamp": "4/22/2025 0:00:00",
    "category": "Business",
    "title": "Sebi Finds No Manufacturing at Gensol’s EV Plant",
    "summary": "Sebi reported no manufacturing at Gensol Engineering’s Pune EV plant, with only 2-3 laborers present during an NSE visit. The company, promoted by brothers Anmol and Puneet Jaggi, faced scrutiny for misleading investor disclosures, raising concerns about its operational claims.",
    "imageUrl": "https://res.cloudinary.com/dgexwlxja/image/upload/v1745324802/Gemini_Generated_Image_j4dgn4j4dgn4j4dg_oafddc.jpg",
    "imagePreview": "",
    "tags": "Sebi investigation, Gensol Engineering, EV plant, investor disclosures, Pune factory, regulatory scrutiny",
    "source": "TOI",
    "author": "Nemo"
  },
  {
    "id": 34,
    "timestamp": "4/22/2025 0:00:00",
    "category": "Business",
    "title": "Uday Kotak Praises Indian Housewife as Smartest Fund Manager",
    "summary": "Banker Uday Kotak called Indian housewives the 'smartest fund managers' for their financial acumen, sparking reactions from Zoho’s Sridhar Vembu. The statement highlights the growing recognition of household financial management in India’s economic narrative.",
    "imageUrl": "https://res.cloudinary.com/dgexwlxja/image/upload/v1745324860/Gemini_Generated_Image_2zrn6f2zrn6f2zrn_lojvuv.jpg",
    "imagePreview": "",
    "tags": "Uday Kotak, Indian housewife, fund manager, financial acumen, household finance, Sridhar Vembu",
    "source": "Hindustan Times",
    "author": "Sahil"
  },
  {
    "id": 35,
    "timestamp": "4/22/2025 0:00:00",
    "category": "Business",
    "title": "Air India Eyes Boeing Jets Rejected by China",
    "summary": "Air India is exploring the acquisition of Boeing 737 MAX jets returned to the US due to China’s trade tensions. This move could bolster Air India’s fleet expansion while helping Boeing offset losses from the US-China tariff war.",
    "imageUrl": "https://res.cloudinary.com/dgexwlxja/image/upload/v1745324903/Gemini_Generated_Image_huyvr6huyvr6huyv_bhfnjm.jpg",
    "imagePreview": "",
    "tags": "Air India, Boeing 737 MAX, US-China trade, fleet expansion, tariff war, aviation industry",
    "source": "NDTV",
    "author": "Anjali"
  },
  {
    "id": 36,
    "timestamp": "4/22/2025 0:00:00",
    "category": "Business",
    "title": "Nifty 50 Surges Past 23,800",
    "summary": "The Nifty 50 crossed 23,800, driven by banking stocks like HDFC and ICICI Bank, and Reliance’s Q4 anticipation. Over ₹10,000 crore in FII inflows in two days, falling crude oil prices, and India-US trade optimism fueled the rally.",
    "imageUrl": "https://res.cloudinary.com/dgexwlxja/image/upload/v1745324943/Gemini_Generated_Image_lqjpxolqjpxolqjp_ckw5ru.jpg",
    "imagePreview": "",
    "tags": "Nifty 50, stock market rally, FII inflows, banking stocks, Reliance Q4, crude oil prices",
    "source": "Indian Express",
    "author": "Pratyush"
  },
  {
    "id": 37,
    "timestamp": "4/22/2025 0:00:00",
    "category": "Business",
    "title": "BluSmart Suspends Operations Amid Co-Founder Probe",
    "summary": "India’s BluSmart, a rival to Uber, halted operations following an investigation into its co-founder. The suspension raises questions about the EV ride-hailing startup’s future, impacting its market presence and investor confidence.",
    "imageUrl": "https://res.cloudinary.com/dgexwlxja/image/upload/v1745325099/Gemini_Generated_Image_3y1m0q3y1m0q3y1m_nyymja.jpg",
    "imagePreview": "",
    "tags": "BluSmart, EV ride-hailing, co-founder probe, Uber rival, startup suspension, investor confidence",
    "source": "Deccan Herald",
    "author": "Pandey"
  },
  {
    "id": 38,
    "timestamp": "4/22/2025 0:00:00",
    "category": "Entertainment",
    "title": "Kantara Becomes India’s Cultural Brand Ambassador",
    "summary": "Rishab Shetty’s Kantara has evolved into a global cultural phenomenon, showcasing India’s rich traditions. From Hanuman Kind to CID, the film’s narrative resonates worldwide, cementing its status as a cultural ambassador for Indian storytelling.",
    "imageUrl": "https://res.cloudinary.com/dgexwlxja/image/upload/v1745325097/image_13_hlhemp.jpg",
    "imagePreview": "",
    "tags": "Kantara, Rishab Shetty, Indian culture, global cinema, cultural ambassador, traditional storytelling",
    "source": "India Today",
    "author": "Aakash"
  },
  {
    "id": 39,
    "timestamp": "4/22/2025 0:00:00",
    "category": "Entertainment",
    "title": "When Life Gives You Tangerines Evokes Tears",
    "summary": "The K-Drama 'When Life Gives You Tangerines' has moved audiences globally with its emotional storytelling. Viewers praise its slice-of-life narrative, calling it a masterpiece for its cathartic depiction of life’s highs and lows.",
    "imageUrl": "https://res.cloudinary.com/dgexwlxja/image/upload/v1745325811/Gemini_Generated_Image_lwbec8lwbec8lwbe_dg6o6z.jpg",
    "imagePreview": "",
    "tags": "K-Drama, When Life Gives You Tangerines, emotional storytelling, slice-of-life, global audience",
    "source": "Aaj Tak",
    "author": "Divyansh"
  },
  {
    "id": 40,
    "timestamp": "4/22/2025 0:00:00",
    "category": "Entertainment",
    "title": "Pope Francis’ Passing Mourned in Bollywood",
    "summary": "Following Pope Francis’ death at 88, Bollywood stars expressed grief, reflecting on his legacy of compassion. The industry joined India’s three-day mourning, with tributes highlighting his global influence.",
    "imageUrl": "https://res.cloudinary.com/dgexwlxja/image/upload/v1745325812/Gemini_Generated_Image_rinjnnrinjnnrinj_fnvicj.jpg",
    "imagePreview": "",
    "tags": "Pope Francis, Bollywood tributes, mourning, compassion legacy, global influence",
    "source": "News18.com",
    "author": "Purvit"
  },
  {
    "id": 41,
    "timestamp": "4/22/2025 0:00:00",
    "category": "Politics",
    "title": "PM Modi Meets US VP JD Vance",
    "summary": "Prime Minister Narendra Modi held a closed-door meeting with US Vice President JD Vance during his four-day India visit. The talks focused on strengthening India-US ties, with energy and defense deals on the table, shaping bilateral relations.",
    "imageUrl": "https://res.cloudinary.com/dgexwlxja/image/upload/v1745326084/ChatGPT_Image_Apr_22_2025_06_17_38_PM_vupemy.png",
    "imagePreview": "",
    "tags": "PM Modi, JD Vance, India-US relations, bilateral talks, energy deals, defense cooperation",
    "source": "TOI",
    "author": "Naresh"
  },
  {
    "id": 42,
    "timestamp": "4/22/2025 0:00:00",
    "category": "Politics",
    "title": "Sibal Slams Dhankhar Over Judiciary Remarks",
    "summary": "Rajya Sabha member Kapil Sibal criticized Vice President Jagdeep Dhankhar for questioning the judiciary’s timeline on presidential decisions, calling it unconstitutional. Sibal’s remarks underscore tensions between political and judicial spheres.",
    "imageUrl": "https://res.cloudinary.com/dgexwlxja/image/upload/v1745326191/image_15_anlqpw.jpg",
    "imagePreview": "",
    "tags": "Kapil Sibal, Jagdeep Dhankhar, judiciary remarks, Rajya Sabha, constitutional debate, political tensions",
    "source": "Hindustan Times",
    "author": "Kalyan"
  },
  {
    "id": 43,
    "timestamp": "4/22/2025 0:00:00",
    "category": "Politics",
    "title": "Rahul Gandhi Pushes for Rohith Vemula Act",
    "summary": "Rahul Gandhi urged Karnataka CM Siddaramaiah to enact the Rohith Vemula Act to combat caste-based discrimination in education. The proposal aims to ensure equitable access and safety for marginalized students.",
    "imageUrl": "https://res.cloudinary.com/dgexwlxja/image/upload/v1745326077/image_14_kg1xp6.jpg",
    "imagePreview": "",
    "tags": "Rahul Gandhi, Rohith Vemula Act, caste discrimination, education reform, Karnataka policy",
    "source": "NDTV",
    "author": "Anand"
  },
  {
    "id": 44,
    "timestamp": "4/22/2025 0:00:00",
    "category": "Politics",
    "title": "India Rejects Bangladesh’s Murshidabad Remarks",
    "summary": "India’s Ministry of External Affairs dismissed Bangladesh’s comments on Murshidabad violence, urging focus on minority rights. The response highlights India’s firm stance on cross-border diplomatic issues.",
    "imageUrl": "https://res.cloudinary.com/dgexwlxja/image/upload/v1745326531/ChatGPT_Image_Apr_22_2025_06_22_34_PM_ezimus.png",
    "imagePreview": "",
    "tags": "India-Bangladesh relations, Murshidabad violence, minority rights, diplomatic response, external affairs",
    "source": "Indian Express",
    "author": "Nemo"
  },
  {
    "id": 45,
    "timestamp": "4/22/2025 0:00:00",
    "category": "Education",
    "title": "NEET MDS 2025 Exam Tomorrow",
    "summary": "The National Board of Examinations will conduct the NEET MDS 2025 exam on April 23, with detailed question distribution released. Aspiring dental professionals are preparing intensely for this critical test.",
    "imageUrl": "https://res.cloudinary.com/dgexwlxja/image/upload/v1745326529/image_16_llluiv.jpg",
    "imagePreview": "",
    "tags": "NEET MDS 2025, dental exam, National Board of Examinations, medical education, student preparation",
    "source": "Deccan Herald",
    "author": "Sahil"
  },
  {
    "id": 46,
    "timestamp": "4/22/2025 0:00:00",
    "category": "Sports",
    "title": "Rohit Sharma Shines in IPL 2025",
    "summary": "Rohit Sharma regained form, leading Mumbai Indians to a four-wicket win over CSK in IPL 2025, with Jasprit Bumrah and Hardik Pandya’s bowling pivotal. His performance silenced critics.",
    "imageUrl": "Rohit Sharma hitting a six in an IPL 2025 match, with a cheering crowd and Mumbai Indians’ colors.",
    "imagePreview": "",
    "tags": "Rohit Sharma, IPL 2025, Mumbai Indians, CSK match, cricket performance, Jasprit Bumrah",
    "source": "India Today",
    "author": "Anjali"
  },
  {
    "id": 47,
    "timestamp": "4/22/2025 0:00:00",
    "category": "Sports",
    "title": "Virat Kohli Breaks IPL Record",
    "summary": "Virat Kohli set a new record for the most fifty-plus scores in IPL history during the 2025 season, reinforcing his dominance as a batting maestro for RCB.",
    "imageUrl": "https://res.cloudinary.com/dgexwlxja/image/upload/v1745327089/ChatGPT_Image_Apr_22_2025_06_31_53_PM_zfvvfv.png",
    "imagePreview": "",
    "tags": "Virat Kohli, IPL record, RCB, fifty-plus scores, cricket legend, batting dominance",
    "source": "Aaj Tak",
    "author": "Pratyush"
  },
  {
    "id": 48,
    "timestamp": "4/22/2025 0:00:00",
    "category": "Sports",
    "title": "Neeraj Chopra Eyes Diamond League in India",
    "summary": "Neeraj Chopra expressed hope that his eponymous event could bring the Diamond League to India, boosting athletics’ global presence and inspiring young talents.",
    "imageUrl": "https://res.cloudinary.com/dgexwlxja/image/upload/v1745327083/Neeraj_Chopra_throwing_a_javelin_at_a_stadium_with_a_Diamond_League_India_banner_in_the_backgroun_jtmla0.jpg",
    "imagePreview": "",
    "tags": "Neeraj Chopra, Diamond League, Indian athletics, javelin throw, global sports",
    "source": "News18.com",
    "author": "Pandey"
  },
  {
    "id": 49,
    "timestamp": "4/22/2025 0:00:00",
    "category": "Technology",
    "title": "India’s Policy Shields Firms from China Dumping",
    "summary": "India’s robust trade policies are protecting domestic firms from China’s dumping threats, bolstering industries like manufacturing and tech, says Carnelian’s Vikas Khemani.",
    "imageUrl": "https://res.cloudinary.com/dgexwlxja/image/upload/v1745327632/Flux_Dev_A_bustling_car_manufacturing_plant_in_India_with_rows_2_ge5sox.jpg",
    "imagePreview": "",
    "tags": "India trade policy, China dumping, domestic firms, tech industry, Vikas Khemani, manufacturing",
    "source": "TOI",
    "author": "Aakash"
  },
  {
    "id": 50,
    "timestamp": "4/22/2025 0:00:00",
    "category": "Technology",
    "title": "Air India Enforces Cabin Baggage Rules",
    "summary": "Air India strictly enforced its 10 kg cabin baggage limit, prompting a passenger to reduce their 13 kg bag. The move, backed online, ensures safety and space efficiency.",
    "imageUrl": "https://res.cloudinary.com/dgexwlxja/image/upload/v1745327631/An_Air_India_check-in_counter_with_a_baggage_scale_and_a_passenger_adjusting_their_luggage._Make_the_bezh1p.jpg",
    "imagePreview": "",
    "tags": "Air India, cabin baggage, airline rules, passenger safety, baggage limit, travel regulations",
    "source": "Hindustan Times",
    "author": "Divyansh"
  },
  {
    "id": 51,
    "timestamp": "4/22/2025 0:00:00",
    "category": "Automobile",
    "title": "India-US Trade Talks Focus on Autos",
    "summary": "India-US trade negotiations are prioritizing automobiles, with Trump pushing for lower duties. The talks could reshape India’s auto export market significantly.",
    "imageUrl": "https://res.cloudinary.com/dgexwlxja/image/upload/v1745327632/Flux_Dev_A_bustling_car_manufacturing_plant_in_India_with_rows_2_ge5sox.jpg",
    "imagePreview": "",
    "tags": "India-US trade, automobile exports, trade negotiations, Trump duties, auto industry, economic",
    "source": "NDTV",
    "author": "Purvit"
  },
  {
    "id": 52,
    "timestamp": "4/22/2025 0:00:00",
    "category": "Hatke",
    "title": "108 Surya Namaskars Transform Body",
    "summary": "Performing 108 Surya Namaskars daily for 30 days can enhance physical and mental health, improving stamina, flexibility, and focus, according to fitness experts.",
    "imageUrl": "https://res.cloudinary.com/dgexwlxja/image/upload/v1745327931/Gemini_Generated_Image_ohqe2rohqe2rohqe_ort2dg.jpg",
    "imagePreview": "",
    "tags": "Surya Namaskar, yoga benefits, physical health, mental wellness, fitness routine, Indian wellness",
    "source": "Indian Express",
    "author": "Naresh"
  },
  {
    "id": 53,
    "timestamp": "4/22/2025 0:00:00",
    "category": "Hatke",
    "title": "Sabja Seeds Boost Curd’s Benefits",
    "summary": "Adding Sabja seeds to curd enhances digestion, hydration, and nutrient absorption, making it a trending superfood combo for health-conscious Indians.",
    "imageUrl": "https://res.cloudinary.com/dgexwlxja/image/upload/v1745327934/Gemini_Generated_Image_b6me2qb6me2qb6me_lubhmo.jpg",
    "imagePreview": "",
    "tags": "Sabja seeds, curd benefits, superfood, digestion health, Indian diet, wellness trend",
    "source": "Deccan Herald",
    "author": "Kalyan"
  },
  {
    "id": 54,
    "timestamp": "4/22/2025 0:00:00",
    "category": "Science",
    "title": "Science Newsletter Simplifies Discoveries",
    "summary": "The Hindu’s 'Science For All' newsletter, published weekly, breaks down complex scientific ideas, making discoveries and debates accessible to all readers.",
    "imageUrl": "https://res.cloudinary.com/dgexwlxja/image/upload/v1745328315/Gemini_Generated_Image_wsxsu2wsxsu2wsxs_vbhaxo.jpg",
    "imagePreview": "",
    "tags": "Science For All, The Hindu newsletter, scientific discoveries, accessible science, weekly updates",
    "source": "India Today",
    "author": "Anand"
  },
  {
    "id": 55,
    "timestamp": "4/22/2025 0:00:00",
    "category": "Travel",
    "title": "Murshidabad Violence Affects Local Tourism",
    "summary": "Violence in Murshidabad, monitored by the Calcutta High Court, has deterred tourists, impacting local travel businesses and cultural heritage sites.",
    "imageUrl": "https://res.cloudinary.com/dgexwlxja/image/upload/v1745328314/Gemini_Generated_Image_rep2uxrep2uxrep2_gyoqlo.jpg",
    "imagePreview": "",
    "tags": "Murshidabad violence, tourism impact, Calcutta High Court, cultural heritage, local business",
    "source": "Aaj Tak",
    "author": "Nemo"
  },
  {
    "id": 56,
    "timestamp": "4/22/2025 0:00:00",
    "category": "Travel",
    "title": "Goa Stray Dog Attack Raises Safety Concerns",
    "summary": "A 15-month-old girl’s death by stray dogs in Goa has sparked safety concerns for travelers, prompting calls for better animal control measures.",
    "imageUrl": "https://res.cloudinary.com/dgexwlxja/image/upload/v1745328408/Gemini_Generated_Image_nnpbgunnpbgunnpb_rvekxt.jpg",
    "imagePreview": "",
    "tags": "Goa stray dogs, traveler safety, animal control, tourism concerns, public safety",
    "source": "News18.com",
    "author": "Sahil"
  },
  {
    "id": 57,
    "timestamp": "4/23/2025 6:00:00",
    "category": "Breaking News",
    "title": "Pahalgam Massacre: 26 Tourists Killed in Kashmir’s Deadliest Civilian Attack Since 2019",
    "summary": "In a devastating assault, militants opened fire on tourists in Baisaran meadow near Pahalgam, killing 26 and injuring over 30. The attack, claimed by “Kashmir Resistance,” marks the worst civilian tragedy in the region since 2019. Indian leaders and global figures, including U.S. President Donald Trump, condemned the violence, highlighting ongoing tensions in the disputed territory.",
    "imageUrl": "https://res.cloudinary.com/dgexwlxja/image/upload/v1745375756/quickNews/terror-attack-1.jpg",
    "imagePreview": "",
    "tags": "Breaking News, India, Terrorism, Kashmir",
    "source": "TOI",
    "author": "Anjali"
  },
  {
    "id": 58,
    "timestamp": "4/23/2025 8:00:00",
    "category": "Breaking News",
    "title": "Tourist Haven Turns Tragic: Gunmen Kill 26 in Pahalgam Amid Rising Kashmir Tensions",
    "summary": "A serene tourist spot in Pahalgam turned into a scene of horror as militants killed 26 visitors, predominantly Indian nationals. The attack coincided with U.S. Vice President JD Vance’s visit, raising concerns about regional security. Authorities suspect the motive was to disrupt the perception of peace and deter tourism in the area.",
    "imageUrl": "https://res.cloudinary.com/dgexwlxja/image/upload/v1745375756/quickNews/terror-attack-2.avif",
    "imagePreview": "",
    "tags": "Breaking News, India, Terrorism, Kashmir",
    "source": "The Hindu",
    "author": "Pratyush"
  },
  {
    "id": 59,
    "timestamp": "4/23/2025 10:00:00",
    "category": "Breaking News",
    "title": "Global Condemnation as Terror Strikes Pahalgam: 26 Tourists Dead in Kashmir Attack",
    "summary": "The international community expressed outrage after militants attacked tourists in Pahalgam, resulting in 26 deaths. The assault, targeting civilians in a popular meadow, underscores the persistent volatility in Kashmir. Leaders worldwide, including those from the U.S., Russia, and the UAE, condemned the act and pledged support to India in combating terrorism.",
    "imageUrl": "https://res.cloudinary.com/dgexwlxja/image/upload/v1745375755/quickNews/terror-attack-3.webp",
    "imagePreview": "",
    "tags": "Breaking News, India, Terrorism, Kashmir",
    "source": "Reuters",
    "author": "Pandey"
  }
]